Emagician-Meta.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emagician-Meta</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Emagician-Meta"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-29 23:26:06 MDT"/>
<meta name="author" content="Jonathan Arkell"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="export/main.css"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emagician-Meta</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Working with Melpa</a></li>
<li><a href="#sec-2">2 Exporting as a website</a>
<ul>
<li><a href="#sec-2-1">2.1 Save website to a seperate directory</a></li>
<li><a href="#sec-2-2">2.2 do some magic to auto-commit to the git branch</a></li>
<li><a href="#sec-2-3">2.3 Set up valid stylesheet for a default</a></li>
<li><a href="#sec-2-4">2.4 Specialized export command</a></li>
<li><a href="#sec-2-5">2.5 Reference code</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Working with Melpa</h2>
<div class="outline-text-2" id="text-1">


<p>
  Since Melpa is what I am throwing my lot with, do some setup.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Exporting as a website</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Save website to a seperate directory</h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> do some magic to auto-commit to the git branch</h3>
<div class="outline-text-3" id="text-2-2">

<p>   <a href="http://help.github.com/pages/">http://help.github.com/pages/</a>
   <a href="http://ryanfitzer.org/2011/11/easy-syncing-of-github-pages/">http://ryanfitzer.org/2011/11/easy-syncing-of-github-pages/</a>
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Set up valid stylesheet for a default</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="example">body {
    margin: 1em;
}
</pre>


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Specialized export command</h3>
<div class="outline-text-3" id="text-2-4">





<pre class="example">(require 'org-publish)
(defun emagician-export/export ()
  "Main export function"
  (let ((org-export-with-section-numbers t)
        (org-hml-include-timestamps nil)
        (org-src-fontify-natively t)
        (org-export-hml-inline-images t)
        (org-publish-project-alist '(("emagician-org"
                                      :base-directory emagician-dir
                                      :base-extension "org"
                                      :publishing-directory "export"
                                      :author-info t
                                      :creator-info t
                                      :publishing-function org-publish-org-to-html)
                                     ("emagician-extra"
                                      :base-directory emagician-dir
                                      :base-extension "css\\|pdf\\|png\\|jpg"
                                      :publishing-function org-publish-attachment
                                      :author nil)
                                     )))))
</pre>


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Reference code</h3>
<div class="outline-text-3" id="text-2-5">





<pre class="example">; Inline images in HTML instead of producting links to the image
(setq org-export-html-inline-images t)
; Do not use sub or superscripts - I currently don't need this functionality in my documents
(setq org-export-with-sub-superscripts nil)
; Use org.css from the norang website for export document stylesheets

(setq org-export-html-style-include-default nil)
; Do not generate internal css formatting for HTML exports
(setq org-export-htmlize-output-type (quote css))
; Export with LaTeX fragments
(setq org-export-with-LaTeX-fragments t)

(setq emagician-org/publish-project-alist
      ;
      ; http://www.norang.ca/  (norang website)
      ; norang-org are the org-files that generate the content
      ; norang-extra are images and css files that need to be included
      ; norang is the top-level project that gets published
      (quote (("emagician-org"
               :base-directory "~/git/www.norang.ca"
               :publishing-directory "/ssh:www-data@www:~/www.norang.ca/htdocs"
               :recursive t
               :table-of-contents nil
               :base-extension "org"
               :publishing-function org-publish-org-to-html
               :style-include-default nil
               :section-numbers nil
               :table-of-contents t
               :style "&lt;link rel=\"stylesheet\" href=\"emagician.css\" type=\"text/css\" /&gt;"
               :author-info t
               :creator-info t)
              ("emagician-extra"
               :base-directory "~/git/www.norang.ca/"
               :publishing-directory "/ssh:www-data@www:~/www.norang.ca/htdocs"
               :base-extension "css\\|pdf\\|png\\|jpg\\|gif"
               :publishing-function org-publish-attachment
               :recursive t
               :author nil)
              ("emagician"
               :components ("emagician-org" "emagician-extra")))))

(defun emagician-meta/save-then-publish ()
  (interactive)
  (save-buffer)
  (org-save-all-org-buffers)
  (org-publish-current-project))


</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-29 23:26:06 MDT</p>
<p class="author">Author: Jonathan Arkell</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
